import 'package:flutter/material.dart';

class LostArkList {
  LostArkList._();

  static List serverList = [
    "루페온",
    "아브렐슈드",
    "실리안",
    "카단",
    "니나브",
    "카제로스"
  ];

  static List classList = [
    "버서커",
    "디스트로이어",
    "워로드",
    "홀리나이트",
    "배틀마스터",
    "인파이터",
    "기공사",
    "창술사",
    "스트라이커",
    "데빌헌터",
    "블래스터",
    "호크아이",
    "스카우터",
    "건슬링어",
    "아르카나",
    "서머너",
    "바드",
    "소서리스",
    "데모닉",
    "블레이드",
    "리퍼",
    "도화가",
    "기상술사",
  ];

  static List type = [
    "요호",
    "데칼",
    "발탄(노말)",
    "발탄(하드)",
    "비아키스(노말)",
    "비아키스(노1,하23)",
    "쿠크세이튼",
    "오레하(2종)",
  ];

  static List fourMemType = [
    "요호",
    "데칼",
    "쿠크세이튼",
    "오레하(2종)",
  ];

  static List specificType = [
    "발탄(노말)",
    "발탄(하드)",
    "비아키스(노말)",
    "비아키스(노1,하23)",
    "쿠크세이튼",
  ];

  static List item = [
    "수호석 결정",
    "수호강석",
    "각성돌",
  ];

  static List jewel1 = [
    "1레벨 청명",
    "2레벨 청명",
    "1레벨 홍염",
    "2레벨 홍염",
    "1레벨 멸화",
    "2레벨 멸화",
  ];
}